### DSTA

#### Relevant Python modules, II: Pandas

##### Solution notebook for reference.

Please also see the [online Pandas resources](https://pandas.pydata.org/docs/getting_started/index.html#getting-started).

In [1]:
# Did you remember to pip install?

import numpy as np
import pandas as pd

### Series

#### Create a series with values 35, 45, 72 at index positions A, B and C

In [2]:
#you could use a dict
sdata = {'A': 35, 'B': 45,'C': 72}

In [3]:
ser_data = pd.Series(sdata)

In [4]:
ser_data

A    35
B    45
C    72
dtype: int64

##### Assign to the index the name 'letters'

In [5]:
ser_data.index.name = 'letters' #set name of column index

In [6]:
ser_data

letters
A    35
B    45
C    72
dtype: int64

##### Assign to the Series the name 'numbers'

In [7]:
ser_data.name = 'numbers' #set name of the series

In [8]:
ser_data

letters
A    35
B    45
C    72
Name: numbers, dtype: int64

#### Turn the series into a Dataframe (DF) with 2 columns, index by letters and numbers. 

The DataFrame should be indexed by numbers starting from 0.

In [9]:
sdf = pd.DataFrame([ser_data]).T # a series is horizontal hence transpose

In [10]:
sdf

         numbers
letters
A             35
B             45
C             72

In [11]:
sdf['letters'] = sdf.index

In [12]:
sdf.index = np.arange(sdf.shape[0])

In [13]:
sdf

   numbers letters
0       35       A
1       45       B
2       72       C

##### Retrieve the data in the second row

In [14]:
sdf.loc[1]

numbers    45
letters     B
Name: 1, dtype: object

##### Retrieve data at the position corresponding to index letters having value B

In [15]:
sdf[sdf['letters'] =='B']

   numbers letters
1       45       B

##### Add a columns call 'added' that takes value of 100 for every row

In [16]:
sdf['added'] = 100 # so you do not have to repeat

In [17]:
sdf

   numbers letters  added
0       35       A    100
1       45       B    100
2       72       C    100

#### Retrieve values of the DF for the rows where the value of index numbers is even (0, 2, 4, ...)

In [18]:
sdf[sdf['numbers']%2==0]

   numbers letters  added
2       72       C    100

##### Retrieve data in the letters column on the first row

In [26]:
sdf.loc[0, 'letters']

'A'

##### Retrieve all data on the second row

In [27]:
sdf.iloc[1:,:]

   numbers letters  added
1       45       B    100
2       72       C    100

##### How many times the value 100 appears in the added column?

In [28]:
sdf['added'].value_counts() # in descending order of frequency

100    3
Name: added, dtype: int64